7767517
38 43
Input                    data                     0 1 data -23330=4,3,56,56,3 0=56 1=56 2=3
Convolution              0_21                     1 1 data 0_21_bn_leaky -23330=4,3,28,28,8 0=8 1=3 3=2 4=1 5=1 6=216 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     1_30                     1 1 0_21_bn_leaky 1_30_bn_leaky -23330=4,3,28,28,8 0=8 1=3 4=1 5=1 6=72 7=8 9=2 -23310=1,1.000000e-01
Convolution              2_39                     1 1 1_30_bn_leaky 2_39_bn -23330=4,3,28,28,4 0=4 1=1 5=1 6=32
Convolution              3_48                     1 1 2_39_bn 3_48_bn_leaky -23330=4,3,28,28,18 0=18 1=1 5=1 6=72 9=2 -23310=1,1.000000e-01
Split                    3_48_bn_leaky_split      1 2 3_48_bn_leaky 3_48_bn_leaky_split_0 3_48_bn_leaky_split_1 -23330=8,3,28,28,18,3,28,28,18
ConvolutionDepthWise     4_57                     1 1 3_48_bn_leaky_split_0 4_57_bn_leaky -23330=4,3,14,14,18 0=18 1=3 3=2 4=1 5=1 6=162 7=18 9=2 -23310=1,1.000000e-01
Convolution              5_66                     1 1 4_57_bn_leaky 5_66_bn -23330=4,3,14,14,6 0=6 1=1 5=1 6=108
Split                    5_66_bn_split            1 2 5_66_bn 5_66_bn_split_0 5_66_bn_split_1 -23330=8,3,14,14,6,3,14,14,6
Convolution              6_75                     1 1 5_66_bn_split_0 6_75_bn_leaky -23330=4,3,14,14,36 0=36 1=1 5=1 6=216 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     7_84                     1 1 6_75_bn_leaky 7_84_bn_leaky -23330=4,3,14,14,36 0=36 1=3 4=1 5=1 6=324 7=36 9=2 -23310=1,1.000000e-01
Convolution              8_93                     1 1 7_84_bn_leaky 8_93_bn -23330=4,3,14,14,6 0=6 1=1 5=1 6=216
Eltwise                  9_102                    2 1 8_93_bn 5_66_bn_split_1 9_102 -23330=4,3,14,14,6 0=1
Convolution              10_107                   1 1 9_102 10_107_bn_leaky -23330=4,3,14,14,18 0=18 1=1 5=1 6=108 9=2 -23310=1,1.000000e-01
Pooling                  12_119                   1 1 3_48_bn_leaky_split_1 12_119 -23330=4,3,14,14,18 1=8 2=2 3=3 14=4 15=4 5=1
Concat                   13_123                   2 1 12_119 10_107_bn_leaky 13_123 -23330=4,3,14,14,36
Convolution              14_127                   1 1 13_123 14_127_bn_leaky -23330=4,3,14,14,24 0=24 1=1 5=1 6=864 9=2 -23310=1,1.000000e-01
Split                    14_127_bn_leaky_split    1 2 14_127_bn_leaky 14_127_bn_leaky_split_0 14_127_bn_leaky_split_1 -23330=8,3,14,14,24,3,14,14,24
ConvolutionDepthWise     15_136                   1 1 14_127_bn_leaky_split_0 15_136_bn_leaky -23330=4,3,7,7,24 0=24 1=3 3=2 4=1 5=1 6=216 7=24 9=2 -23310=1,1.000000e-01
Convolution              16_145                   1 1 15_136_bn_leaky 16_145_bn -23330=4,3,7,7,8 0=8 1=1 5=1 6=192
Split                    16_145_bn_split          1 2 16_145_bn 16_145_bn_split_0 16_145_bn_split_1 -23330=8,3,7,7,8,3,7,7,8
Convolution              17_154                   1 1 16_145_bn_split_0 17_154_bn_leaky -23330=4,3,7,7,40 0=40 1=1 5=1 6=320 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     18_163                   1 1 17_154_bn_leaky 18_163_bn_leaky -23330=4,3,7,7,40 0=40 1=3 4=1 5=1 6=360 7=40 9=2 -23310=1,1.000000e-01
Convolution              19_172                   1 1 18_163_bn_leaky 19_172_bn -23330=4,3,7,7,8 0=8 1=1 5=1 6=320
Eltwise                  20_181                   2 1 19_172_bn 16_145_bn_split_1 20_181 -23330=4,3,7,7,8 0=1
Split                    20_181_split             1 2 20_181 20_181_split_0 20_181_split_1 -23330=8,3,7,7,8,3,7,7,8
Convolution              21_186                   1 1 20_181_split_0 21_186_bn_leaky -23330=4,3,7,7,40 0=40 1=1 5=1 6=320 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     22_195                   1 1 21_186_bn_leaky 22_195_bn_leaky -23330=4,3,7,7,40 0=40 1=3 4=1 5=1 6=360 7=40 9=2 -23310=1,1.000000e-01
Convolution              23_204                   1 1 22_195_bn_leaky 23_204_bn -23330=4,3,7,7,8 0=8 1=1 5=1 6=320
Eltwise                  24_213                   2 1 23_204_bn 20_181_split_1 24_213 -23330=4,3,7,7,8 0=1
Convolution              25_218                   1 1 24_213 25_218_bn_leaky -23330=4,3,7,7,24 0=24 1=1 5=1 6=192 9=2 -23310=1,1.000000e-01
Pooling                  27_230                   1 1 14_127_bn_leaky_split_1 27_230 -23330=4,3,7,7,24 1=4 2=2 3=1 14=2 15=2 5=1
Concat                   28_234                   2 1 27_230 25_218_bn_leaky 28_234 -23330=4,3,7,7,48
Convolution              29_237                   1 1 28_234 29_237_bn_leaky -23330=4,3,7,7,40 0=40 1=1 5=1 6=1920 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     30_246                   1 1 29_237_bn_leaky 30_246_bn_leaky -23330=4,3,7,7,40 0=40 1=3 4=1 5=1 6=360 7=40 9=2 -23310=1,1.000000e-01
Convolution              31_255                   1 1 30_246_bn_leaky 31_255_bn_leaky -23330=4,3,7,7,32 0=32 1=1 5=1 6=1280 9=2 -23310=1,1.000000e-01
Convolution              32_264                   1 1 31_255_bn_leaky 32_264 -23330=4,3,7,7,18 0=18 1=1 5=1 6=576
Yolov3DetectionOutput    detection_out            1 1 32_264 output 0=1 1=3 2=2.500000e-01 -23304=6,9.000000e+00,1.400000e+01,1.200000e+01,1.700000e+01,2.200000e+01,2.100000e+01 -23305=3,0,1065353216,1073741824 -23306=1,8.000000e+00
